1bobby-git/HA-iOS-ANCS/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
# CONFIG_BT_NIMBLE_ENABLED is not set
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_GATTC_ENABLE=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_LE_50_FEATURE_SUPPORT=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ANCS_APP_ID_MAX=256
CONFIG_ANCS_TITLE_MAX=512
CONFIG_ANCS_SUBTITLE_MAX=512
CONFIG_ANCS_MESSAGE_MAX=4096
CONFIG_ANCS_DATE_MAX=32
CONFIG_ANCS_REQUEST_QUEUE_CAPACITY=16
CONFIG_ANCS_REQUEST_TIMEOUT_MS=3000
CONFIG_ANCS_WORKER_STACK_SIZE=8192
CONFIG_ANCS_WORK_QUEUE_LENGTH=24
CONFIG_ANCS_MAX_FRAGMENT_SIZE=512
CONFIG_ANCS_CACHE_CAPACITY=4
CONFIG_ANCS_DUPLICATE_WINDOW_MS=500
